# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of join statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, you'll use the same Customer Relationship Management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [1]:
#Your code here
import sqlite3
conn = sqlite3.connect('data.sqlite')
c = conn.cursor()

## Display the names of all the employees in Boston.
Hint: join the employees and offices tables.

In [ ]:
import pandas as pd
#Your code here
d1 = pd.DataFrame(c.execute("""select * from employees join offices 
                            using (officeCode) where city == 'Boston'""").fetchall())
d1.columns = [x[0] for x in c.description]
d1

In [ ]:
d2 = pd.DataFrame(c.execute("""select * from offices""").fetchall())
d2.columns = [x[0] for x in c.description]
d2

## Do any offices have no employees?
Hint: Combine the employees and offices tables and use a group by.

In [4]:
#Your code here
d3 = pd.DataFrame(c.execute("""select count(employeeNumber) from employees join offices 
                            using (officeCode) group by officeCode""").fetchall())
d3.columns = [x[0] for x in c.description]
d3

   count(employeeNumber)
0                      6
1                      2
2                      2
3                      5
4                      2
5                      4
6                      2

## Write 3 Questions of your own and answer them

In [5]:
# Answers will vary

In [6]:
# Your code here

In [7]:
# Your code here

In [8]:
# Your code here

## Level Up: Display the names of each product each employee has sold

In [44]:
# Your code here
d4 = pd.DataFrame(c.execute("""select employeeNumber, lastName, firstName, productName from 
                                employees e
                                join customers c
                                on e.employeeNumber == c.salesRepEmployeeNumber
                                join orders o
                                using (customerNumber)
                                join orderdetails od
                                using (orderNumber)
                                join products p
                                using (productCode)
                                """).fetchall())
d4.columns = [x[0] for x in c.description] 
print(len(d4))
d4.head()

2996

,employeeNumber,lastName,firstName,productName
0,1165,Jennings,Leslie,1958 Setra Bus
1,1165,Jennings,Leslie,1940 Ford Pickup Truck
2,1165,Jennings,Leslie,1939 Cadillac Limousine
3,1165,Jennings,Leslie,1996 Peterbilt 379 Stake Bed with Outrigger
4,1165,Jennings,Leslie,1968 Ford Mustang

## Level Up: Display the Number of Products each employee has sold

In [48]:
#Your code here
d4.groupby("employeeNumber").count()

                lastName  firstName  productName
employeeNumber
1165                 331        331          331
1166                 114        114          114
1188                 124        124          124
1216                 152        152          152
1286                 142        142          142
1323                 211        211          211
1337                 177        177          177
1370                 396        396          396
1401                 272        272          272
1501                 236        236          236
1504                 220        220          220
1611                 185        185          185
1612                 185        185          185
1621                 137        137          137
1702                 114        114          114

## Summary

Congrats! You now know how to use join statements, along with leveraging your foreign keys knowledge!